package job4j.loop;

public class Print0ToN {
	
	public static void out(int n) {
		for (int i = 0; i < n; i++) {
			System.out.println(i);
		}
	}
}

/* 1. Вывести на консоль числа от 0 до N
 *
 * Выведите на консоль числа от 0 до N. N не входит. В этом упражнении используйте цикл for c index.
 */
