package job4j.firstProgram;

public class HelloWorld {
	public static void main(String[] args) {
		System.out.println("Hello, Job4j!");
	}
}

/* 1. Забытая точка с запятой
 *
 * Каждый оператор в Java должен заканчиваться точкой с запятой. Исправьте ошибку в приведенном коде.
 */

/* 2.3. Не закрытый метод
 *
 * В методе main забыли закрывающую скобку. Поправь код приведенный ниже.
 */

/* 2. Забытая скобка
 *
 * Весь код в Java пишется внутри блоков ограниченных фигурными скобками { и }. Исправьте ошибку в приведенном коде.
 */

/* 2.1. Пропущенная скобка в блоке классе
 *
 * Код в Java можно писать только внутри класса. Класс ограничен блоком фигурных скобок.
 * Ниже приведен код. Поправьте в нем ошибку.
 */

/* 2.2. Не закрытый класс
 *
 * Ниже приведен код в котором забыли закрыт блок класса. Поправьте ошибку.
 */

/* 2.4. Скобки только фигурные
 *
 * Начинающий Java программист решил заменить фигурные скобки на круглые. Так делать нельзя.
 * Java требует использовать только фигурные скобки для блоков.
 * Поправьте код приведенный ниже.
 *
 * package ru.job4j;

	public class HelloWorld (
        public static void main(String[] args) (
            System.out.println("Hello, Job4j!");
        )
	)
 */

/* 2.5. Python стиль в Java
 *
 * Программист из Python решил написать код на Java. В Python блоки разделяются отступами, а в Java фигурными скобками.
 * Поправьте код приведенный ниже.
 *
 * package ru.job4j;

	public class HelloWorld
        public static void main(String[] args)
            System.out.println("Hello, Job4j!");
 */

/* 2.6. Блоки для методов
 *
 * В Java класс и метод должны содержать границы блока. Блок ограничивается фигурными скобками.
 * Поправьте приведенный ниже код.
 */